### chapter 2

In [1]:
import pandas as pd

In [10]:
#dict 형태
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1, 2, 3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
#행열순서
df.loc[3,"a"]

6

In [7]:
#복수개일경우에는 리스트 데이터 타입으로 감싸서 가져오기
df.loc[[1,2],["a","b"]]

   a  b
1  4  7
2  5  8

In [11]:
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3],
    columns=['a', 'b', 'c'])

In [12]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [18]:
#dic 형태 
#인덱스를 멀티로 처리 : 튜플로 정의 
#인덱스 이름 정의 n v
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))

In [17]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [19]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]})

In [20]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [21]:
df = pd.DataFrame(
    [[4, 7, 10],
    [5, 8, 11],
    [6, 9, 12]],
    index=[1, 2, 3])

In [22]:
df

   0  1   2
1  4  7  10
2  5  8  11
3  6  9  12

### chapter 3
- subset observations(rows)

In [25]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))

In [26]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [27]:
df[df.a > 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [28]:
df[df. b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [29]:
df.b > 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [30]:
#컬럼명은 대소문자를 구분한다.
df[df["c"] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [31]:
df[df["c"] < 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

### Logic in Python

In [33]:
#중복된 값을 제거
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [39]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3)],
        names=['n','v']))

In [40]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [36]:
#중복된 값을 제거
# e2 e3 중복하여 제거
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [37]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [41]:
#권장하지 않음. inplace 파라미터 다시 재 선언을 추천
# df.drop_duplicates(inplace=True)
#df = df.drop_duplicates()
#df = df.drop_duplicates(keep='first')
#df = df.drop_duplicates(keep='last')

### chapter 4
- logic in python

In [44]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [45]:
df[["a"]] != 7

        a
n v
d 1  True
  2  True
e 2  True

In [46]:
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [47]:
#7이 아닌값만 인덱싱
df[df["b"] != 7 ]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [52]:
df.a.isin

<bound method Series.isin of n  v
d  1    4
   2    5
e  2    6
Name: a, dtype: int64>

In [53]:
df.a.isin(5)

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

In [54]:
# 타입오류 발생 isin에는 리스트 형태로 데이터를 담아야함. list like

In [55]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [56]:
df.a.isin([5,6])

n  v
d  1    False
   2     True
e  2     True
Name: a, dtype: bool

In [58]:
#한글 또는 특수문자일 경우 [] 형태로 가져와서 처리
df["a"].isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [60]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [61]:
import numpy as np
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8,  np.nan, 9, 9],
        "c" : [10, 11,  np.nan, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))

In [62]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN   NaN
  3  6.0  9.0  12.0
  4  NaN  9.0  12.0

In [63]:
#null값을 표시
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True   True
  3  False  False  False
  4   True  False  False

In [64]:
df['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [66]:
df['a'].isnull().sum()

1

In [67]:
#not null인 값에 반대
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False  False
  3   True   True   True
  4  False   True   True

In [68]:
df.notnull()

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False  False
  3   True   True   True
  4  False   True   True

In [69]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [70]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

# & | ~ & any() df.all()
# and or not xor any all

In [71]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [72]:
1 and 2

2

In [73]:
True and False

False

In [74]:
False and False

False

### 데이터 프레임에서는 and 대신 & 사용

In [78]:
df[df.b == 7] & df[df.a == 5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

In [79]:
df[df.b == 7] | df[df.a == 5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

### chapter 5

In [81]:
import numpy as np
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8,  np.nan, 9, 9],
        "c" : [10, 11,  np.nan, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))

In [82]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN   NaN
  3  6.0  9.0  12.0
  4  NaN  9.0  12.0

In [83]:
df.head(3)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN   NaN

In [84]:
df.tail(2)

       a    b     c
n v
e 3  6.0  9.0  12.0
  4  NaN  9.0  12.0

In [86]:
#frac은 특정 비율로 샘플링을 해옴.
df.sample(frac=0.5)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0  12.0

In [87]:
df.sample(frac=0.7)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0  12.0
  2  6.0  NaN   NaN
d 1  4.0  7.0  10.0

In [88]:
#1인경우는 전부를 가져오고 순서는 랜덤으로 가져옴
df.sample(frac=1)

       a    b     c
n v
d 1  4.0  7.0  10.0
e 2  6.0  NaN   NaN
  3  6.0  9.0  12.0
d 2  5.0  8.0  11.0
e 4  NaN  9.0  12.0

In [90]:
# n이라는 매개변수 #갖고 있는 값보다는 큰 값을 가질 수 없음. n은 현재 5개
# 특정 갯수만 샘플링 해오고 싶은 경우
df.sample(n=2)

       a    b     c
n v
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0

In [91]:
#select row by position
df.iloc[10:20]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [92]:
df.iloc[1:2]

       a    b     c
n v
d 2  5.0  8.0  11.0

In [93]:
# 0부터 2-1개부터
df.iloc[:2]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [94]:
#3번째 인덱스
df.iloc[3:]

       a    b     c
n v
e 3  6.0  9.0  12.0
  4  NaN  9.0  12.0

In [95]:
df.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0  12.0
  4  NaN  9.0  12.0

In [96]:
df.nlargest?

In [97]:
 df = pd.DataFrame({'a': [1, 10, 8, 10, -1],
                    'b': list('abdce'),
                    'c': [1.0, 2.0, np.nan, 3.0, 4.0]})

In [98]:
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  10  c  3.0
4  -1  e  4.0

In [99]:
#a컬럼에서 3개의 큰 값을 가져옴
df.nlargest(3,'a')

    a  b    c
1  10  b  2.0
3  10  c  3.0
2   8  d  NaN

In [100]:
# 컬럼의 데이터 타입이 숫자형에서만 가능함.
df.nlargerst(3,'b')

AttributeError: 'DataFrame' object has no attribute 'nlargerst'

In [101]:
df.nsmallest(3,'a')

   a  b    c
4 -1  e  4.0
0  1  a  1.0
2  8  d  NaN

In [102]:
df.nsmallest(1,'a')

   a  b    c
4 -1  e  4.0